# ==========================================
# 电器 1：测电压（老师给你的样板，请原样照敲）
# ==========================================
def measure_voltage(pin_name):
    print(f"⚡ [动作] 拿万用表红黑表笔接触了 {pin_name} 引脚...")
    if pin_name == "VCC":
        return "3.3V"
    else:
        return "0V"

# ==========================================
# 电器 2：测温度（你的任务：请模仿上面的格式补全代码！）
# ==========================================
def measure_temperature(object_name):
    print(f"[动作]拿起了温度枪瞄准了泡面")
    if object_name == "泡面":
        return "95°"
    else:
        return "室温25°"

    # TODO 2: 写一个 if-else 判断。
    # 如果 object_name 是 "泡面"，就 return "95度"
    # 否则，就 return "室温 25度"
    

# ==========================================
# 电器 3：开关风扇（你的任务：请模仿格式补全代码！）
# ==========================================
def turn_on_fan(gear_level):
    print(f"[动作]把风扇拧到了3档")
    return "把风扇拧到了3档"
    # TODO 3: 打印一句话，比如 "🌀 [动作] 咔哒一声，把风扇拧到了 XXX 档..."
    
    # TODO 4: 直接 return 一句话，比如 "风扇已开启，当前风力：XXX"
    

# ==========================================
# 🔌 测试环节：给这三个电器通电运行！
# ==========================================
print("=== 宿舍电器测试开始 ===")

# 测试 1
result_1 = measure_voltage("VCC")
print(f"👉 测试1结果:{result_1}\n")

# 测试 2 (等你补全代码后，把下面两行的注释 # 删掉)
result_2 = measure_temperature("泡面")
print(f"👉 测试2结果:{result_2}\n")

# 测试 3 (等你补全代码后，把下面两行的注释 # 删掉)
result_3 = turn_on_fan("3档")
print(f"👉 测试3结果:{result_3}\n")